HELYXcore-4.4.0/examples/legacy/DNS/dnsFoam/boxTurb16/0/U
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector>
4096
(
(-0.0376011 0.020584 -0.0051027)
(-0.0262359 0.0149309 -0.0048244)
(-0.0141003 0.00810973 -0.00427023)
(-0.00304323 0.00116024 -0.00352459)
(0.00525225 -0.00486054 -0.00270092)
(0.00952492 -0.00903873 -0.00192446)
(0.00912652 -0.0107411 -0.00131334)
(0.00411911 -0.00970993 -0.000960557)
...
)
;

boundaryField
{
    patch0_half0
    {
        type            cyclic;
    }
    patch0_half1
    {
        type            cyclic;
    }
    patch1_half0
    {
        type            cyclic;
    }
    patch1_half1
    {
        type            cyclic;
    }
    patch2_half0
    {
        type            cyclic;
    }
    patch2_half1
    {
        type            cyclic;
    }
}


// ************************************************************************* //
