HELYXcore-4.4.0/examples/legacy/DNS/dnsFoam/boxTurb16/Allrun
#!/bin/bash
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $HELYX_PROJECT_DIR/bin/tools/RunFunctions

# Get application name
application=$(getApplication)

cp 0/U 0/U.orig

runApplication blockMesh
runApplication boxTurb
runApplication $application
runApplication postProcess -func enstrophy

#------------------------------------------------------------------------------
